ProgessBase/Catalogs/КонтурEDI_Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КонтурEDI_Сообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСерииЗаказов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_ДополнительныеСправочники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КП_ИмпортированныйЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Comment>Сохраняет ответ от сервера, в случае возрата от него ошибки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклоненоОтправителем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоУведомлениеОПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Comment>Признак того, что сообщение является архивным, т.е. не требует дальнейших действий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуемоеДействие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлXML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/InformationRegisters/КонтурEDI_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтурEDI_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяСтатуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Catalogs/КонтурEDI_Сообщения/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Эмулируем заполнение необходимых реквизитов здесь. В будущем лучше вынести в код модуля.
	
	Если Направление = "Исходящее" Тогда
		Архив = ((Статус = "Доставлен") 
			Или (Статус = "ИсходящийПодписанВДиадок" )
			Или (Статус = "Подписан покупателем" ) /// Кунов О.В., 11.08.2017 - 69392
			Или (Статус = "Подписан получателем" ) /// Кунов О.В., 09.11.2017 - 72501
			Или (Статус = "Подписан и отправлен" ));
	Иначе
		Архив = (Статус = "Загружен" )
//		Или (Статус = "Отклонен" )
		И Не ОтклоненоОтправителем
		И Не ТребуемоеДействие = "СозданИмпортированныйЗаказ";//по отклоненным сообщениям цепочку продолжать не будем
	КонецЕсли;	
	
	//укажем ДатуЗагрузки для исходящих сообщений, будем также и по ней сортировать
	Если Не ЗначениеЗаполнено(ДатаЗагрузки) И ЭтоНовый() Тогда
		ДатаЗагрузки = ТекущаяДата();//могут быть проблемы с разным временем на разных компах
	КонецЕсли;	
	
	//И сюда же проставим Партнера, НомерЗаказа, ТочкуДоставки
	СтруктураСообщения = Хранилище.Получить();
	Если ТипЗнч(СтруктураСообщения) = Тип("Структура") Тогда
		Если Не ЗначениеЗаполнено(Партнер) Тогда
			Если Направление = "Исходящее" Тогда
				Если СтруктураСообщения.Свойство("Получатель1С")
					Тогда
					Партнер = СтруктураСообщения.Получатель1С;
				КонецЕсли;	
			Иначе
				Если СтруктураСообщения.Свойство("Отправитель1С")
					Тогда
					Партнер = СтруктураСообщения.Отправитель1С;
				КонецЕсли;	
			КонецЕсли;		
		КонецЕсли;//Партнер
		
		Если Не ЗначениеЗаполнено(ДатаПоставки) 
			И СтруктураСообщения.Свойство("ДатаПоставки") Тогда
			ДатаПоставки = СтруктураСообщения.ДатаПоставки;
		КонецЕсли; //ДатаПоставки
		
		Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
			Если СтруктураСообщения.Свойство("ТипСообщения") 
				И СтруктураСообщения.ТипСообщения = "ORDERS"
				И СтруктураСообщения.Свойство("ДокументEDI")
				И СтруктураСообщения.ДокументEDI.Свойство("Номер")
				Тогда
				НомерЗаказа = СтруктураСообщения.ДокументEDI.Номер;
			ИначеЕсли СтруктураСообщения.Свойство("ЗаказEDI")
				И ТипЗнч(СтруктураСообщения.ЗаказEDI) = Тип("Структура")
				И СтруктураСообщения.ЗаказEDI.Свойство("Номер")
				Тогда
				НомерЗаказа = СтруктураСообщения.ЗаказEDI.Номер;
			КонецЕсли;
		КонецЕсли; //НомерЗаказа
		
		Если Не ЗначениеЗаполнено(ДатаЗаказа) Тогда
			Если СтруктураСообщения.Свойство("ТипСообщения") 
				И СтруктураСообщения.ТипСообщения = "ORDERS"
				И СтруктураСообщения.Свойство("ДокументEDI")
				И СтруктураСообщения.ДокументEDI.Свойство("Дата")
				Тогда
				ДатаЗаказа = СтруктураСообщения.ДокументEDI.Дата;
			ИначеЕсли СтруктураСообщения.Свойство("ЗаказEDI")
				И ТипЗнч(СтруктураСообщения.ЗаказEDI) = Тип("Структура")
				И СтруктураСообщения.ЗаказEDI.Свойство("Дата")
				Тогда
				ДатаЗаказа = СтруктураСообщения.ЗаказEDI.Дата;
			КонецЕсли;
		КонецЕсли; //ДатаЗаказа
		
	КонецЕсли;
	
	//Еще отдельно проверим, нет ли в статусах сообщений записи по данному документу "Принят частично"
	//Пока статус не сменится на "Принят частично (обработан)", не помещаем сообщение в архив.
	Если ТипСообщения = "RECADV" И Направление = "Входящее" 
		И ЗначениеЗаполнено(Документ)
		Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурEDI_СтатусыДокументов.Документ
		|ИЗ
		|	РегистрСведений.КонтурEDI_СтатусыДокументов КАК КонтурEDI_СтатусыДокументов
		|ГДЕ
		|	КонтурEDI_СтатусыДокументов.Документ = &Документ
		|	И КонтурEDI_СтатусыДокументов.ИмяСтатуса = ""Приемка""
		|	И КонтурEDI_СтатусыДокументов.Статус = ""Принят частично"""
		);
		Запрос.УстановитьПараметр("Документ",Документ);
		Если Не Запрос.Выполнить().Пустой() Тогда
			Архив = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	// аналогично для торговых сетей проверим 
	Если ТипСообщения = "ORDRSP" И Направление = "Входящее" И ЗначениеЗаполнено(Документ) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурEDI_СтатусыДокументов.Документ
		|ИЗ
		|	РегистрСведений.КонтурEDI_СтатусыДокументов КАК КонтурEDI_СтатусыДокументов
		|ГДЕ
		|	КонтурEDI_СтатусыДокументов.Документ = &Документ
		|	И КонтурEDI_СтатусыДокументов.ИмяСтатуса = ""Заказ""
		|	И КонтурEDI_СтатусыДокументов.Статус = ""Уточнен"""
		);
		Запрос.УстановитьПараметр("Документ",Документ);
		Если Не Запрос.Выполнить().Пустой() Тогда
			Архив = Ложь;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры
